// 在全域資料庫中，註冊「究喝茶莊」
allShopsDatabase["究喝茶莊"] = {
    color: "#003E24", // 究喝茶莊招牌的墨綠色
    menu: {
        "究喝特調": [
            {name: "八冰綠", prices: {"大杯(大)": 50}},
            {name: "芒果青", prices: {"大杯(大)": 55}},
            {name: "冰釀梅子茶", prices: {"大杯(大)": 35}},
            {name: "傳統冬瓜茶", prices: {"大杯(大)": 35}},
            {name: "招牌梅子綠", prices: {"大杯(大)": 40}},
            {name: "百香果綠茶", prices: {"大杯(大)": 40}},
            {name: "養樂多綠茶", prices: {"大杯(大)": 45}}
        ],
        "究喝果茶": [
            {name: "柳橙金萱", prices: {"大杯(大)": 60}},
            {name: "鳳梨金萱", prices: {"大杯(大)": 45}},
            {name: "冬瓜檸檬", prices: {"大杯(大)": 50}},
            {name: "金桔檸檬", prices: {"大杯(大)": 50}},
            {name: "鮮榨檸檬汁", prices: {"大杯(大)": 50}},
            {name: "新鮮水果茶", prices: {"大杯(大)": 60}}
        ],
        "究喝拿鐵": [
            {name: "紅茶拿鐵", prices: {"大杯(大)": 55}},
            {name: "觀音拿鐵", prices: {"大杯(大)": 60}},
            {name: "烏龍拿鐵", prices: {"大杯(大)": 60}},
            {name: "阿華田拿鐵", prices: {"大杯(大)": 60}},
            {name: "珍珠紅茶拿鐵", prices: {"大杯(大)": 60}},
            {name: "巧克力凍拿鐵", prices: {"大杯(大)": 60}},
            {name: "古早味黑糖拿鐵", prices: {"大杯(大)": 60}},
            {name: "古早味黑糖珍珠拿鐵", prices: {"大杯(大)": 65}},
            {name: "古早味黑糖布丁拿鐵", prices: {"大杯(大)": 70}}
        ],
        "究喝好茶": [
            {name: "四季春青茶", prices: {"大杯(大)": 30}},
            {name: "台灣茉香綠", prices: {"大杯(大)": 30}},
            {name: "高山金萱茶", prices: {"大杯(大)": 30}},
            {name: "阿里山烏龍", prices: {"大杯(大)": 30}},
            {name: "古早味紅茶", prices: {"大杯(大)": 30}},
            {name: "阿薩姆紅茶", prices: {"大杯(大)": 30}}
        ],
        "究喝冷泡": [
            {name: "冷泡梨山茶", prices: {"大杯(大)": 40}},
            {name: "冷泡白毫香片", prices: {"大杯(大)": 40}},
            {name: "冷泡日月潭紅茶", prices: {"大杯(大)": 40}}
        ],
        "究喝現泡": [
            {name: "現泡梨山茶", prices: {"大杯(大)": 40}},
            {name: "現泡桂花青", prices: {"大杯(大)": 40}},
            {name: "現泡鐵觀音", prices: {"大杯(大)": 40}},
            {name: "現泡普洱茶", prices: {"大杯(大)": 40}},
            {name: "現泡白毫香片", prices: {"大杯(大)": 40}},
            {name: "現泡碧綠溪青茶", prices: {"大杯(大)": 40}},
            {name: "現泡日月潭紅茶", prices: {"大杯(大)": 40}}
        ]
    },
    toppings: [
        {name: "珍珠", price: 10},
        {name: "椰果", price: 10},
        {name: "咖啡凍", price: 10},
        {name: "布丁", price: 15}
    ]
};
