// 在全域資料庫中，註冊「八曜和茶」
allShopsDatabase["八曜和茶"] = {
    color: "#3F5643", // 八曜和茶的品牌墨綠色
    menu: {
        "和風茶": [
            {name: "八曜和茶", prices: {"大杯(L)": 35}},
            {name: "和風308", prices: {"大杯(L)": 50}},
            {name: "83蜂凝露", prices: {"大杯(L)": 55}},
            {name: "和風307", prices: {"大杯(L)": 50}},
            {name: "究極308", prices: {"大杯(L)": 42}},
            {name: "朝日覺醒紅茶", prices: {"大杯(L)": 40}},
            {name: "83蜂見茶", prices: {"大杯(L)": 60}}
        ],
        "自然茶": [
            {name: "極上307", prices: {"大杯(L)": 37}},
            {name: "舞伎406紅茶", prices: {"大杯(L)": 46}},
            {name: "大地覺醒紅茶", prices: {"大杯(L)": 35}},
            {name: "明日清爽茶", prices: {"大杯(L)": 35}},
            {name: "焙煎黑烏龍", prices: {"大杯(L)": 35}}
        ],
        "纖果爽": [
            {name: "柚香覺醒307", prices: {"大杯(L)": 67}},
            {name: "柚香覺醒紅茶", prices: {"大杯(L)": 65}},
            {name: "八曜雙C纖檸露", prices: {"大杯(L)": 50}},
            {name: "寧夏307", prices: {"大杯(L)": 60}},
            {name: "明日清爽檸檬茶", prices: {"大杯(L)": 55}},
            {name: "京楓檸檬紅茶", prices: {"大杯(L)": 50}},
            {name: "八曜黑檸檬茶", prices: {"大杯(L)": 55}},
            {name: "83蜂檸爽爽", prices: {"大杯(L)": 65}}
        ],
        "厚奶茶": [
            {name: "覺醒奶茶", prices: {"大杯(L)": 55}},
            {name: "匠心奶茶", prices: {"大杯(L)": 60}},
            {name: "深煎黑龍奶茶", prices: {"大杯(L)": 55}},
            {name: "京彩舞伎奶茶", prices: {"大杯(L)": 66}},
            {name: "冬の恋奶茶", prices: {"大杯(L)": 66}},
            {name: "308炙燒濃乳", prices: {"大杯(L)": 66}},
            {name: "83蜂潮奶茶", prices: {"大杯(L)": 69}},
            {name: "雪匠奶茶", prices: {"大杯(L)": 69}}
        ],
        "鮮乳定制": [
            {name: "八曜和風 (茶乳)", prices: {"大杯(L)": 55}},
            {name: "八曜和風 (乳茶)", prices: {"大杯(L)": 65}},
            {name: "牧場覺醒 (茶乳)", prices: {"大杯(L)": 55}},
            {name: "牧場覺醒 (乳茶)", prices: {"大杯(L)": 65}},
            {name: "牧場黑烏龍 (茶乳)", prices: {"大杯(L)": 60}},
            {name: "牧場黑烏龍 (乳茶)", prices: {"大杯(L)": 70}},
            {name: "牧場307 (茶乳)", prices: {"大杯(L)": 65}},
            {name: "牧場307 (乳茶)", prices: {"大杯(L)": 75}},
            {name: "牧場308 (茶乳)", prices: {"大杯(L)": 65}},
            {name: "牧場308 (乳茶)", prices: {"大杯(L)": 75}},
            {name: "贅沢香焙歐蕾 (茶乳)", prices: {"大杯(L)": 66}},
            {name: "贅沢香焙歐蕾 (乳茶)", prices: {"大杯(L)": 76}}
        ],
        "乳酸樂多": [
            {name: "樂多307", prices: {"大杯(L)": 70}},
            {name: "樂多308", prices: {"大杯(L)": 70}},
            {name: "八曜樂多", prices: {"大杯(L)": 60}},
            {name: "明日樂多", prices: {"大杯(L)": 60}}
        ],
        "JLJL 益生菌": [
            {name: "激酵JLJL蜂凝菌乳茶", prices: {"大杯(L)": 79}},
            {name: "順解JLJL柚香菌乳茶", prices: {"大杯(L)": 79}}
        ],
        "龍片504系列": [
            {name: "浪煎龍片504", prices: {"大杯(L)": 54}},
            {name: "龍香燕麥奶504", prices: {"大杯(L)": 89}},
            {name: "浪烤厚焙乳504", prices: {"大杯(L)": 89}},
            {name: "龍片牧場504 (茶乳)", prices: {"大杯(L)": 89}},
            {name: "龍片牧場504 (乳茶)", prices: {"大杯(L)": 99}}
        ]
    },
    toppings: [
        {name: "蜜漬白玉丸", price: 10},
    ]
};
